import streamlit as st



st.header("Мини визуализации про преступность в Мехико сити")

st.write("""
Я нашел сырые данные на официльном сайте про каждое отдельное преступление, совершенное в Мехико,
 сопоставил данные с координатами  и получил вот такое распределение по муниципалитетам в разные годы. Первое же, что надо
 сразу отметить — Мехико — это огромный город, самый большой в Северной Америке. Каждый из его муниципалитетов по населению примерно как Екатеринбург. 
 Также важно понимать, что перечисленные ниже числа для каждого из преступлений включают в себя все подвиды данных преступлений, то есть, например, убийства включают в себя также и те, что совершены по ошибки и тп.""")

with st.echo(code_location="above"):
    import plotly.express as px
    import numpy as np
    import pandas as pd
    from PIL import Image
    import requests
    from io import BytesIO
    import altair as alt
    import seaborn as sns
    import matplotlib.pyplot as plt
    import urllib.request

    @st.cache
    def homocids():
        return pd.read_csv("https://raw.githubusercontent.com/SovBakoid/MEXICOCRIMES/master/homocides.csv")

    homocides=homocids()

    homocides

    @st.cache
    def robbers():
        return pd.read_csv("https://raw.githubusercontent.com/SovBakoid/MEXICOCRIMES/master/robberies.csv")

    robberies=robbers()

    robberies

    @st.cache
    def travmi():
        return pd.read_csv("https://raw.githubusercontent.com/SovBakoid/MEXICOCRIMES/master/traumas.csv")

    traumas=travmi()

    traumas


st.write("Итак. Вот такие данные мы имеем про убийства")

with st.echo(code_location="above"):
    yaochenhochuvmexico=px.histogram(homocides, x="Municipio", y="value", animation_frame="Ano" ).update_layout(
    title={"text": "Убийства"}, yaxis_title="Число инцидентов за год", xaxis_title="Муниципалитет")
    st.plotly_chart(yaochenhochuvmexico)

st.write("""Вот так вот это выглядит на карте за 2019 год. Беру 2019 год,
потому что 2020 и 2021 немного не репрезентативны из-за коронавируса. Красным цветом отмечены муниципалитеты, где 
более 300 инцидентов, оранжевым, где от 200 до 300, желтым — от 100 до 200, зеленым — до 100.
""")

with st.echo(code_location="above"):
    @st.cache()
    def imagge1():
        response = requests.get('https://github.com/SovBakoid/MEXICOCRIMES/raw/master/homocidesmap.png')
        return Image.open(BytesIO(response.content))

    image1=imagge1()

    st.image(image1)

st.write("Вот, что мы имеем про кражи")

with st.echo(code_location="above"):
    yaochenhochuvmexico=px.histogram(robberies, x="Municipio", y="value", animation_frame="Ano").update_layout(
    title={"text": "Кражи"}, yaxis_title="Число инцидентов за год", xaxis_title="Муниципалитет",  yaxis_range=[0, 20000])
    st.plotly_chart(yaochenhochuvmexico)

st.write("Вот опять же карта, составленная по аналогичной логике")

with st.echo(code_location="above"):
    @st.cache()
    def imagge2():
        response = requests.get('https://github.com/SovBakoid/MEXICOCRIMES/raw/master/robberiesmap.png')
        return Image.open(BytesIO(response.content))

    image2=imagge2()

    st.image(image2)

st.write("""
Теперь посмотрим на инцеденты физических повреждений
""")

with st.echo(code_location="above"):
    yaochenhochuvmexico=px.histogram(traumas, x="Municipio", y="value", animation_frame="Ano").update_layout(
    title={"text": "Травмы"}, yaxis_title="Число инцидентов за год", xaxis_title="Муниципалитет")
    st.plotly_chart(yaochenhochuvmexico)

st.write("По традиции, вот карта.")

with st.echo(code_location="above"):
    @st.cache()
    def imagge3():
        response = requests.get('https://github.com/SovBakoid/MEXICOCRIMES/raw/master/traumasmap.png')
        return Image.open(BytesIO(response.content))

    image3=imagge3()

    st.image(image3)

st.write("""
Теперь, наконец-то, небольшой анализ. Важно понимать, что я отмечал цветами карту преступности муниципалитетов относительно друг-друга. 
То есть если какой-то муниципалитет желтый, это не означает, что он уже немного напряженный, а лишь, что относительно других районов он не среди самых безопасных.
По всем параметром муниципалитет Iztapalapa сильно более опасный чем все остальные. Я почитал про него, это район дешевых новостроек.
Там нет никаких достопримечательностей. Если мы этот район удалим с нашей карты (это вообще с радостью), то 
увидим, что статистка безопасности Мехико резко улучшилась. То есть просто не посищая этот район, мои шансы нарваться на неприятности
резко уменьшаются. 
""")

st.write("""
ИТАМ находится в районе La Magdalena Contreras. По всем использованным показателям это самый или почти самый безопасный район Мехико.
Но, согласен, есть риски связанные с кражами в туристических зонах Мехико. Это решается довольно просто. 
Я просто не буду брать с собой ничего кроме необходимого.
""")

st.write("""
Теперь посмотрим на то, что пишут про безопасность этого города в статьях. Читать нечто подобное на русском нерелевантно, так
как это как правило нисшевые статьи, написанные непонятно кем и для кого, потому что Россия и Мексика довольно далеко друг от друга расположены.
Теперь берем гугл и смотрим, что там пишут. Вот первые три ссылки, которые я получил, сделав запрос 'уровень преступности
против туристов в Мехико'.
""")

with st.echo(code_location="above"):
    @st.cache()
    def imagge4():
        response = requests.get('https://github.com/SovBakoid/MEXICOCRIMES/raw/master/image4.png')
        return Image.open(BytesIO(response.content))

    image4=imagge4()

    st.image(image4)

st.write("""Краткое содержание первой ссылки (вот сама ссылка https://travellemming.com/is-mexico-city-safe/ . 
Ее можно открыть в браузере и перевести по кнопке сверху справа, чтобы проверить, что я там сам ничего не придумываю):
Безопасен ли Мехико для путешествий? Многие люди беспокоятся, что Мехико опасен. Тем не менее, это легкое место для безопасного посещения, если вы будете подготовленным.
На самом деле в Мехико относительно низкий уровень преступности по сравнению с другими регионами страны. Даже в некоторых штатах США уровень преступности значительно выше, чем в Мехико.
Небезопасные места в Мехико обычно находятся в определенных районах, что упрощает туристам выбор более безопасных зон.
Некоторые из районов Мехико, которые в целом безопасны для посещения, — это Roma Norte/Sur, Condesa, Centro Historico и Zona Rosa. Это наиболее туристические места города, в которых путешественники, как правило, чувствуют себя наиболее комфортно. Однако будьте осторожны в этих районах, так как все еще существует потенциал для мошенничества.
Другими районами, которые все еще очень безопасны, но менее переполнены туристами, являются Хуарес, Эскандон, Сан-Рафаэль, Койоакан и Поланко. Конечно, это верхушка айсберга — в Мехико действительно так много интересных мест, которые можно открыть, оставаясь при этом в безопасности.
Тем не менее есть ряд мест, которые нужно избегать. В первую очередь Iztapalapa, также рынок Tepito и Ciudad Neza. 
Doctores безопасен днем, но риски повышаются ночью.
Также настоятельно рекомендуется иметь хорошую страховку на случай заболевания коронавирусом (ее мне предоставит ИТАМ).
Нет никаких сомнений в том, что в Мехико происходят преступления — это почти неизбежный признак большого города.
Большинство преступлений, совершенных в Мехико, - это угон транспортных средств, грабежи и убийства. Из-за этого в городе огромное количество полиции.
Все это звучит очень напряженно, но пусть это пока не отпугивает вас от Мехико. Высокий уровень преступности обычно наблюдается в отдельных кластерых районах. Это делает намного более простым держаться подальше от более потенциально опасных мест.
Кроме того, в Мехико по-прежнему довольно низкий уровень преступности по сравнению с остальной частью страны и даже некоторыми штатами США.
Не забывайте о себе, пока исследуете Мехико, но преступления, вероятно, не помешают безопасному путешествию, если вы руководствуетесь здравым смыслом и избегаете опасных мест.
""")

st.write("""
Также автор перечисляет популярные уловки, которые я прочитал и принял к сведению. Вообще автор пришел к идентичному выводу, но не по данным,
а на личном опыте проживания и общения в Мехико. Ситауация складывается примерно как в Австралии, где есть крокодилы, но 
от этого никто не умирает, если не сует им голову в пасть. Даже, если я все-таки идиот, то, учитывая, что я там буду жестко учиться, я все-равно не смогу оказаться в дурацкой ситуации.
""")

st.write("""
Можно легко рассчитать риски. В всей Мексике на 100 тысяч человек погибает от убийств 18 человек. Звучит довольно угрожающе,
но, например, в Американском городе Орландо (где мы, кстати, были), который впервую очередь известен своим Диснейлэндом, на 100 тысяч человек 8 погибают от убийств.
И это, если что, по американским меркам ниже среднего. То есть всего в два раза меньше. Но это данные по всем людям в Мексике. 
При этом среди туристов на 100 тысяч человек в Мексике погибают от убийств всего 2.1. То есть каким-нибудь Американцам безопаснее находится в Мексике чем у себя на родине в городе, ориентированном на детей.
Итак, на 100 тысяч человек погибают двое. То есть шанс умереть для туриста находящегося в Мексике ровно год равен 0.00002. Значит, за пол года он равен 0.00001. Ну как бы это даже не погрешность, это вообще ничто.
(Данные взял вот отсюда https://vallarta.grandvelas.com/newsroom/hotel/americanssaferinmexico )
""")

st.write("""
Теперь про воровство. Я узнал цены. Допустим я еду в самый центр от вуза на дорогом легальном такси от зарегестрированной конторы. 
Путь далекий, целых 13 киллометоров, поэтому мне это будет стоить 338 песо. Допустим я хочу там погулять, поужинать в крутом ресторане Panadería Rosetta и доехать назад. Тогда я с собой беру 338 песо на такси, 
в ресторане я планирую взять Ciabatta de cerdo contado, guacamole y hierbas — 160 песо и что-нибудь еще на 200 песо. Также я думаю, что могу захотеть еще что-нибудь или мне может понадобиться купить билеты в музей, 
поэтому беру дополнительно еще 500 песо с запасом. Итого у меня с собой 338+360+500=1198 песо, что примерно равно 3600 рублей. Если меня ограбят сразу, как я выйду из такси, то я потеряю 3600 рублей.
Если бы я планировал то же самое в Москве, то мне парковка бы обошлась в тысячу рублей, два полноценных блюда в аналогичном по уровню ресторане в 2000 тысячи и билеты на выстовку в оставшиеся 600 рублей.
То есть получается, что я бы точно также потерял бы эти деньги как будто меня ограбили, хоть меня вроде не ограбили и я доехал на собственной машине.
""")

st.write("""
Про безопасность жилья. Ну тут коротко: Во-первых, жить я буду в самом безопасном районе. Во-вторых, Мексика большая, земля дешевая. 
Там можно снять пентхаус с охраной по цене однушки в Рогово. Я, конечно, утрирую, но цены на качественное жилье в Мехико реально гораздо ниже чем в Москве.
Кстати, в Рогово я был с политической агитацией и выжил, а это наверно было опаснее чем с флагом США по плащади в Северной Корее пройтись, так что выживать я умею (тут тоже утрирую).
""")








